[{
		"name": "Knock at the Cabin/Film synopsis",
		"description": "While vacationing at a remote cabin in the woods, a young girl and her parents are taken hostage by four armed strangers who demand they make an unthinkable choice to avert the apocalypse. Confused, scared and with limited access to the outside world, the family must decide what they believe before all is lost.",
		"img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSIwkIQtqPuQ8d-7CfHP9XkRoHTt1RWyGkXHZdQsUTesyz3UnFg6-r_WUJmTyN2pMJ9cE8&usqp=CAU"
	
	}, {
		"name": "Where will Knock at the Cabin be filmed?",
		"description": "Burlington County, New Jersey. Principal photography took place in Burlington County, New Jersey, from April 19 to June 10, 2022, with cinematographer Jarin Blaschke. Shyamalan shot the film with 1990s lenses to give it an "old-school thriller" look. During post-production, Herdís Stefánsdóttir composed the score.",
		"img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSIwkIQtqPuQ8d-7CfHP9XkRoHTt1RWyGkXHZdQsUTesyz3UnFg6-r_WUJmTyN2pMJ9cE8&usqp=CAU"
	
  }, {
		"name": "Language",
		"description": "Anglais",
		"img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSIwkIQtqPuQ8d-7CfHP9XkRoHTt1RWyGkXHZdQsUTesyz3UnFg6-r_WUJmTyN2pMJ9cE8&usqp=CAU"
    
    }, {
		"name": "Production Companies",
		"description": "-Universal Pictures -Blinding Edge Pictures -FilmNation Entertainment",
		"img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSIwkIQtqPuQ8d-7CfHP9XkRoHTt1RWyGkXHZdQsUTesyz3UnFg6-r_WUJmTyN2pMJ9cE8&usqp=CAU"
	
	
  }, {
		"name": "Genres",
		"description": "-Horreur -Mystère -Thriller",
		"img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSIwkIQtqPuQ8d-7CfHP9XkRoHTt1RWyGkXHZdQsUTesyz3UnFg6-r_WUJmTyN2pMJ9cE8&usqp=CAU"
	
  }, {
		"name": "Did you know",
		"description": "Anecdotes As with director M. Night Shyamalan's last movie, Old (2021), Knock at the Cabin will be shot on 35mm film. Shyamalan and his cinematographer Jarin Blaschke used lenses from the 1990s to give the film a "classic '90s thriller look".",
		"img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSIwkIQtqPuQ8d-7CfHP9XkRoHTt1RWyGkXHZdQsUTesyz3UnFg6-r_WUJmTyN2pMJ9cE8&usqp=CAU"
	
  }, {
		"name": "Dave Bautista heralds the apocalypse in M. Night Shyamalan's Knock at the Cabin trailer",
		"description": "M. Night Shyamalan is back, and he just might be bringing the end of the world with him. After we got the aging beach in the film Old and the creepy baby in his series Servant, the filmmaker has set his sights on a creepy cabin and the four strangers who terrorize its residents. The first Knock at the Cabin trailer, bringing to life author Paul G. Tremblay's horror novel The Cabin at the End of the World, arrived at the stroke of midnight on the West Coast Wednesday night. The movie, like the book, follows two dads who bring their child to a remote cabin for a vacation and are then visited and taken hostage by a quartet who demand the parents make an impossible choice. If they don't, it's apocalypse time.",
		"img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSIwkIQtqPuQ8d-7CfHP9XkRoHTt1RWyGkXHZdQsUTesyz3UnFg6-r_WUJmTyN2pMJ9cE8&usqp=CAU"
	}
]
